In [4]:
import pandas as pd

In [6]:
data = {
    "a": [1,2,3,4],
    "b": [4,5,6,7],
    "c": ["sudh", "krish", "hitesh", "navin"]
}

In [8]:
df = pd.DataFrame(data)

In [10]:
df

   a  b       c
0  1  4    sudh
1  2  5   krish
2  3  6  hitesh
3  4  7   navin

In [14]:
df.set_index('a', inplace=True)

In [16]:
df

   b       c
a
1  4    sudh
2  5   krish
3  6  hitesh
4  7   navin

In [20]:
df = df.reset_index()

In [22]:
df

   a  b       c
0  1  4    sudh
1  2  5   krish
2  3  6  hitesh
3  4  7   navin

In [26]:
data = {
    "a": [1,2,3,4],
    "b": [4,5,6,7],
    "c": ["sudh", "krish", "hitesh", "navin"]
}

df1 = pd.DataFrame(data, index = ['a', 'b', 'c', 'd'])

In [28]:
df1

   a  b       c
a  1  4    sudh
b  2  5   krish
c  3  6  hitesh
d  4  7   navin

In [30]:
df1.reindex(['b', 'c', 'd', 'a'])

   a  b       c
b  2  5   krish
c  3  6  hitesh
d  4  7   navin
a  1  4    sudh

In [32]:
df1

   a  b       c
a  1  4    sudh
b  2  5   krish
c  3  6  hitesh
d  4  7   navin

In [40]:
for i, j in df1.iterrows():
    print(j)

a       1
b       4
c    sudh
Name: a, dtype: object
a        2
b        5
c    krish
Name: b, dtype: object
a         3
b         6
c    hitesh
Name: c, dtype: object
a        4
b        7
c    navin
Name: d, dtype: object

In [46]:
for col_name, column in df1.items():
    print(col_name, column)

a a    1
b    2
c    3
d    4
Name: a, dtype: int64
b a    4
b    5
c    6
d    7
Name: b, dtype: int64
c a      sudh
b     krish
c    hitesh
d     navin
Name: c, dtype: object

In [56]:
list(df1['a'])

[1, 2, 3, 4]

In [58]:
[i for i in df['a']]

[1, 2, 3, 4]

In [60]:
df1

   a  b       c
a  1  4    sudh
b  2  5   krish
c  3  6  hitesh
d  4  7   navin

In [66]:
def test(x):
    return x.sum()
    
df1.apply(test)

a                      10
b                      22
c    sudhkrishhiteshnavin
dtype: object

In [68]:
df1

   a  b       c
a  1  4    sudh
b  2  5   krish
c  3  6  hitesh
d  4  7   navin

In [70]:
df2 = df1[['a', 'b']]

In [72]:
df2

   a  b
a  1  4
b  2  5
c  3  6
d  4  7

In [78]:
df2.applymap(lambda x : x**2)

/var/folders/rv/pw1qbgxd5xb8ks1_rywswp8m0000gn/T/ipykernel_82809/4004635628.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df2.applymap(lambda x : x**2)

    a   b
a   1  16
b   4  25
c   9  36
d  16  49

In [80]:
df1

   a  b       c
a  1  4    sudh
b  2  5   krish
c  3  6  hitesh
d  4  7   navin

In [82]:
df

   a  b       c
0  1  4    sudh
1  2  5   krish
2  3  6  hitesh
3  4  7   navin

In [84]:
df.sort_values('c')

   a  b       c
2  3  6  hitesh
1  2  5   krish
3  4  7   navin
0  1  4    sudh

In [86]:
df

   a  b       c
0  1  4    sudh
1  2  5   krish
2  3  6  hitesh
3  4  7   navin

In [90]:
df.sort_index(ascending=False)

   a  b       c
3  4  7   navin
2  3  6  hitesh
1  2  5   krish
0  1  4    sudh

In [100]:
pd.set_option("display.max_colwidth", 1000)
df3 = pd.DataFrame({"Desc": ["At PW Skills, we integrate the power of artificial intelligence to deliver you the knowledge of the most popular cutting-edge technologies to upskill yourself. With Generative AI, you can become the top 1% of skilled staff at our workplace and discover better working opportunities. You can choose our course, data science course to learn and harness the power of AI and boost your productivity by 10X. Learn advanced AI tools such as DALL.E, ChatGPT, Eleven Labs, Luma AI, Wonder Studio and more. Many of our courses are now powered by artificial intelligence to help boost your productivity and learn integrative AI with tools to make it more powerful and effective. Our data science course offers the most affordable and interactive way of learning technologies online. We provide dedicated faculty to help you throughout your learning journey. Get peer-to-peer doubt-solving sessions to help collaborative learning and track your progress while learning. Additionally, we also offer various free learning courses with valuable resources, practice questions and regular assessments. Enrol now to experience interactive learning and hands-on practical experience at PW Skills."]})

In [102]:
df3

                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                      Desc
0  At PW Skills, we integrate the power of artificial intelligence to deliver you the knowledge of the most popular cutting-edge technologies to upskill yourself. With Generative AI, you can become the top 1% of skilled staff at our workplace and discover better working opportunities. You can choose our course, data science course to learn and harness the power of AI and boost your productivity by 10X. Learn advanced AI tools such as DALL.E, ChatGPT, Eleven Labs, Luma AI, Wonder Studio and more. Many of our courses are now powered by artificial intelligence to help boost your productivity and learn integrative AI with tools to make it more powerful and effective. Our data science course offers the most affordable and interactive way of learning technologies online. We provide dedicated faculty to help you throughout your learning journey. Get peer-to-peer doubt-solving sessions to help collaborative learning and track your progress while learning. Additionally, we also offer various f...

In [106]:
pd.set_option("display.max_colwidth", 1000)
df3 = pd.DataFrame({"Desc": ["At PW Skills, we integrate the power of artificial intelligence to deliver you the knowledge of the most popular cutting-edge technologies to upskill yourself. With Generative AI, you can become the top 1% of skilled staff at our workplace and discover better working opportunities. You can choose our course, data science course to learn and harness the power of AI and boost your productivity by 10X. Learn advanced AI tools such as DALL.E, ChatGPT, Eleven Labs, Luma AI, Wonder Studio and more. Many of our courses are now powered by artificial intelligence to help boost your productivity and learn integrative AI with tools to make it more powerful and effective. Our data science course offers the most affordable and interactive way of learning technologies online. We provide dedicated faculty to help you throughout your learning journey. Get peer-to-peer doubt-solving sessions to help collaborative learning and track your progress while learning. Additionally, we also offer various free learning courses with valuable resources, practice questions and regular assessments. Enrol now to experience interactive learning and hands-on practical experience at PW Skills.", "hello, how are you", "welcome to the data science course"]})

In [108]:
df3

                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                      Desc
0  At PW Skills, we integrate the power of artificial intelligence to deliver you the knowledge of the most popular cutting-edge technologies to upskill yourself. With Generative AI, you can become the top 1% of skilled staff at our workplace and discover better working opportunities. You can choose our course, data science course to learn and harness the power of AI and boost your productivity by 10X. Learn advanced AI tools such as DALL.E, ChatGPT, Eleven Labs, Luma AI, Wonder Studio and more. Many of our courses are now powered by artificial intelligence to help boost your productivity and learn integrative AI with tools to make it more powerful and effective. Our data science course offers the most affordable and interactive way of learning technologies online. We provide dedicated faculty to help you throughout your learning journey. Get peer-to-peer doubt-solving sessions to help collaborative learning and track your progress while learning. Additionally, we also offer various f...
1                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       hello, how are you
2                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       welcome to the data science course

In [110]:
df3['len'] = df3['Desc'].apply(len)

In [112]:
df3

,Desc,len
0,"At PW Skills, we integrate the power of artificial intelligence to deliver you the knowledge of the most popular cutting-edge technologies to upskill yourself. With Generative AI, you can become the top 1% of skilled staff at our workplace and discover better working opportunities. You can choose our course, data science course to learn and harness the power of AI and boost your productivity by 10X. Learn advanced AI tools such as DALL.E, ChatGPT, Eleven Labs, Luma AI, Wonder Studio and more. Many of our courses are now powered by artificial intelligence to help boost your productivity and learn integrative AI with tools to make it more powerful and effective. Our data science course offers the most affordable and interactive way of learning technologies online. We provide dedicated faculty to help you throughout your learning journey. Get peer-to-peer doubt-solving sessions to help collaborative learning and track your progress while learning. Additionally, we also offer various f...",1178
1,"hello, how are you",18
2,welcome to the data science course,34

In [118]:
t = "Welcome to the data science"
len(t.split())

5

In [122]:
df3['word_count'] = df3['Desc'].apply(lambda x : len(x.split()))

In [124]:
df3

,Desc,len,word_count
0,"At PW Skills, we integrate the power of artificial intelligence to deliver you the knowledge of the most popular cutting-edge technologies to upskill yourself. With Generative AI, you can become the top 1% of skilled staff at our workplace and discover better working opportunities. You can choose our course, data science course to learn and harness the power of AI and boost your productivity by 10X. Learn advanced AI tools such as DALL.E, ChatGPT, Eleven Labs, Luma AI, Wonder Studio and more. Many of our courses are now powered by artificial intelligence to help boost your productivity and learn integrative AI with tools to make it more powerful and effective. Our data science course offers the most affordable and interactive way of learning technologies online. We provide dedicated faculty to help you throughout your learning journey. Get peer-to-peer doubt-solving sessions to help collaborative learning and track your progress while learning. Additionally, we also offer various f...",1178,179
1,"hello, how are you",18,4
2,welcome to the data science course,34,6

In [126]:
df

   a  b       c
0  1  4    sudh
1  2  5   krish
2  3  6  hitesh
3  4  7   navin

In [130]:
df['a'][0]

1

In [132]:
df

   a  b       c
0  1  4    sudh
1  2  5   krish
2  3  6  hitesh
3  4  7   navin

In [134]:
df['a'].mean()

2.5

In [136]:
df['a'].median()

2.5

In [138]:
df['a'].mode()

0    1
1    2
2    3
3    4
Name: a, dtype: int64

In [140]:
df['a'].std()

1.2909944487358056

In [142]:
df['a'].sum()

10

In [144]:
df['a'].min()

1

In [146]:
df['a'].max()

4

In [148]:
df['a'].var()

1.6666666666666667

In [154]:
#Python - Window Functions

In [156]:
df4 = pd.DataFrame({'a': [3,4,5,2,1,3,4,5,6]})

In [158]:
df4

   a
0  3
1  4
2  5
3  2
4  1
5  3
6  4
7  5
8  6

In [168]:
df4['a'].rolling(window=1).mean()

0    3.0
1    4.0
2    5.0
3    2.0
4    1.0
5    3.0
6    4.0
7    5.0
8    6.0
Name: a, dtype: float64

In [170]:
df4['a'].rolling(window=2).mean()

0    NaN
1    3.5
2    4.5
3    3.5
4    1.5
5    2.0
6    3.5
7    4.5
8    5.5
Name: a, dtype: float64

In [172]:
df4['a'].rolling(window=3).mean()

0         NaN
1         NaN
2    4.000000
3    3.666667
4    2.666667
5    2.000000
6    2.666667
7    4.000000
8    5.000000
Name: a, dtype: float64

In [174]:
df4['a'].rolling(window=3).sum()

0     NaN
1     NaN
2    12.0
3    11.0
4     8.0
5     6.0
6     8.0
7    12.0
8    15.0
Name: a, dtype: float64

In [176]:
df4['a'].rolling(window=3).min()

0    NaN
1    NaN
2    3.0
3    2.0
4    1.0
5    1.0
6    1.0
7    3.0
8    4.0
Name: a, dtype: float64

In [178]:
df4['a'].rolling(window=3).max()

0    NaN
1    NaN
2    5.0
3    5.0
4    5.0
5    3.0
6    4.0
7    5.0
8    6.0
Name: a, dtype: float64

In [180]:
df4['a'].cumsum()

0     3
1     7
2    12
3    14
4    15
5    18
6    22
7    27
8    33
Name: a, dtype: int64

In [182]:
#Date Functionality

In [184]:
date = pd.date_range(start='2023-04-23', end='2023-06-23')

In [186]:
date

DatetimeIndex(['2023-04-23', '2023-04-24', '2023-04-25', '2023-04-26',
               '2023-04-27', '2023-04-28', '2023-04-29', '2023-04-30',
               '2023-05-01', '2023-05-02', '2023-05-03', '2023-05-04',
               '2023-05-05', '2023-05-06', '2023-05-07', '2023-05-08',
               '2023-05-09', '2023-05-10', '2023-05-11', '2023-05-12',
               '2023-05-13', '2023-05-14', '2023-05-15', '2023-05-16',
               '2023-05-17', '2023-05-18', '2023-05-19', '2023-05-20',
               '2023-05-21', '2023-05-22', '2023-05-23', '2023-05-24',
               '2023-05-25', '2023-05-26', '2023-05-27', '2023-05-28',
               '2023-05-29', '2023-05-30', '2023-05-31', '2023-06-01',
               '2023-06-02', '2023-06-03', '2023-06-04', '2023-06-05',
               '2023-06-06', '2023-06-07', '2023-06-08', '2023-06-09',
               '2023-06-10', '2023-06-11', '2023-06-12', '2023-06-13',
               '2023-06-14', '2023-06-15', '2023-06-16', '2023-06-17',
               '2023-06-18', '2023-06-19', '2023-06-20', '2023-06-21',
               '2023-06-22', '2023-06-23'],
              dtype='datetime64[ns]', freq='D')

In [188]:
df_date = pd.DataFrame({'date': date})

In [190]:
df_date

         date
0  2023-04-23
1  2023-04-24
2  2023-04-25
3  2023-04-26
4  2023-04-27
..        ...
57 2023-06-19
58 2023-06-20
59 2023-06-21
60 2023-06-22
61 2023-06-23

[62 rows x 1 columns]

In [192]:
df7 = pd.DataFrame({'date': ['2023-06-23', '2023-06-22', '2023-06-20']})

In [194]:
df7

         date
0  2023-06-23
1  2023-06-22
2  2023-06-20

In [196]:
df7.dtypes

date    object
dtype: object

In [198]:
df_date.dtypes

date    datetime64[ns]
dtype: object

In [200]:
df7['updated_date'] = pd.to_datetime(df7['date'])

In [202]:
df7

         date updated_date
0  2023-06-23   2023-06-23
1  2023-06-22   2023-06-22
2  2023-06-20   2023-06-20

In [204]:
df7.dtypes

date                    object
updated_date    datetime64[ns]
dtype: object

In [206]:
df7['year'] = df7['updated_date'].dt.year

In [208]:
df7['day'] = df7['updated_date'].dt.day

In [210]:
df7['month'] = df7['updated_date'].dt.month

In [212]:
df7

         date updated_date  year  day  month
0  2023-06-23   2023-06-23  2023   23      6
1  2023-06-22   2023-06-22  2023   22      6
2  2023-06-20   2023-06-20  2023   20      6

In [214]:
#Time Delta

In [220]:
pd.Timedelta(days = 1, hours = 5, minutes = 45)

Timedelta('1 days 05:45:00')

In [222]:
dt = pd.to_datetime('2023-06-20')

In [224]:
td = pd.Timedelta(days = 1)

In [226]:
dt + td

Timestamp('2023-06-21 00:00:00')

In [228]:
dt - td

Timestamp('2023-06-19 00:00:00')

In [230]:
#Categorical Data

In [236]:
data = ["sudh", "krish", "hitesh", "navin", "sudh", "sudh"]

In [240]:
cat = pd.Categorical(data)

In [242]:
cat.value_counts()

hitesh    1
krish     1
navin     1
sudh      3
Name: count, dtype: int64